{
    "header": {
        "skills": "Habilidades",
        "projects": "Proyectos",
        "trajectory": "Trayectoria",
        "about_me": "Sobre mí",
        "contact": "Contacto",
        "light_mode": "Modo Claro",
        "dark_mode": "Modo Oscuro",
        "language_selector": "Idioma",
        "language_portuguese": "Portugués",
        "language_english": "Inglés",
        "language_spanish": "Español"
    },
    "hero_section": {
        "tagline": "Desarrollador Full Stack",
        "subtitle": "Transformando ideas en soluciones digitales robustas y escalables."
    },
    "about_page": {
        "profile_alt": "Tauan Ribeiro - Desarrollador Full Stack",
        "title": "Tauan Ribeiro: Desarrollador Full Stack JavaScript",
        "subtitle": "Soluciones Prácticas y Crecimiento Continuo",
        "paragraph1": "Como Desarrollador Full Stack JavaScript con 5 años de experiencia, me apasiona transformar ideas complejas en aplicaciones web escalables y de alto rendimiento. Mi experiencia abarca el ecosistema JavaScript, con dominio en Node.js, Express.js, React.js y Next.js, y una pasión intrínseca por la resolución de problemas y la creación de soluciones eficientes y elegantes.",
        "paragraph2": "Mi trayectoria en el mundo de la tecnología está marcada por una exitosa transición de una década de experiencia en Humanidades, incluyendo formación en Letras por la USP, traducción, revisión y enseñanza. Esta base me ha dotado de un valioso conjunto de habilidades: una meticulosa atención al detalle, esencial para la calidad del código y la depuración; una comunicación clara y efectiva, fundamental para la colaboración en equipo y la comprensión de requisitos; y un pensamiento analítico agudo para desentrañar desafíos complejos. Esta trayectoria demuestra mi notable capacidad de aprendizaje continuo, adaptabilidad y resiliencia ante nuevos horizontes.",
        "paragraph3": "Lo que más me motiva en el desarrollo de software es la infinidad de posibilidades que surgen al iniciar un código, al crear una lógica o una función. Me encanta la libertad de explorar diversos enfoques y soluciones creativas para un mismo problema, buscando siempre el camino más optimizado. Soy un gran entusiasta de la comunidad de desarrollo y creo que este es el punto fuerte de nuestra profesión. Valoro mucho la forma en que el conocimiento, las soluciones y los métodos se comparten de manera abierta e irrestricta, y cómo esta dinámica impulsa la evolución de la comunidad en su conjunto, una filosofía que busco replicar en cualquier entorno de trabajo.",
        "paragraph4": "Mi curiosidad me impulsa a explorar las fronteras de la tecnología. Soy un usuario activo de Inteligencia Artificial, que considero un potente multiplicador de productividad y conocimiento, y busco profundizar mis estudios en IA y Machine Learning. Además, sigo con gran interés el universo Blockchain, reconociendo su creciente impacto y su potencial transformador.",
        "paragraph5": "Actualmente establecido en Valencia, España, donde resido desde 2022 y trabajo de forma remota para una empresa brasileña, busco una oportunidad que me permita crecer y evolucionar a largo plazo. Tengo grandes expectativas para mi carrera y aspiro a un entorno donde pueda contribuir significativamente al éxito del equipo y de la empresa, mientras continúo mejorando mis habilidades y expandiendo mi impacto. Soy un profesional enfocado, dedicado a la productividad y a la búsqueda incesante de mejoras continuas."
    },
    "project_details": {
        "api_monitor": {
            "title": "API Monitor",
            "subtitle": "Garantizando la Fiabilidad y el Rendimiento de Sus APIs",
            "overview_title": "Visión General y Funcionalidades Clave",
            "overview_text": "El API Monitor es una herramienta esencial para desarrolladores y equipos de operaciones que buscan garantizar la salud y el rendimiento continuo de sus APIs...",
            "features_title": "Funcionalidades Principales:",
            "feature_1": "Monitorización Continua: Verificaciones programadas y automáticas de la disponibilidad y el tiempo de respuesta de las APIs.",
            "feature_2": "Alertas Personalizables: Notificaciones instantáneas por correo electrónico u otros canales cuando una API falla o excede los umbrales de rendimiento.",
            "feature_3": "Historial de Rendimiento: Gráficos y registros detallados para analizar tendencias de tiempo de actividad, latencia y errores a lo largo del tiempo.",
            "feature_4": "Configuración Flexible: Añada, edite y elimine APIs para monitorización con facilidad, definiendo intervalos de verificación y criterios de éxito/fallo.",
            "feature_5": "Actualizaciones en Tiempo Real: Panel interactivo que refleja instantáneamente el estado de las APIs, gracias a la comunicación bidireccional.",
            "stack_title": "Stack Tecnológico",
            "stack_text": "A pesar de una interfaz minimalista, el poder del API Monitor reside en su robusta arquitectura de backend y en la eficiencia de sus tecnologías...",
            "frontend_title": "Frontend:",
            "backend_infra_title": "Backend e Infraestructura:",
            "architecture_title": "Arquitectura y Detalles de Implementación",
            "architecture_text": "El API Monitor adopta una arquitectura distribuida y orientada a eventos, donde el frontend y el backend se comunican a través de REST y WebSockets (Socket.IO)...",
            "flow_title": "Flujo de Datos y Comunicación:",
            "flow_1": "El usuario configura una API para monitorización a través del frontend.",
            "flow_2": "El backend registra la API en PostgreSQL (a través de Prisma) y añade una tarea a la cola de BULL.",
            "flow_3": "Los workers independientes consumen tareas de la cola de BULL, realizando solicitudes HTTP a las APIs externas, midiendo el tiempo de respuesta y el estado.",
            "flow_4": "Los resultados se envían de vuelta al backend, que los persiste en PostgreSQL y, en caso de cambios críticos de estado, dispara eventos a través de Socket.IO al frontend.",
            "flow_5": "El frontend recibe estas actualizaciones en tiempo real, manteniendo el panel siempre sincronizado.",
            "flow_6": "Si hay un fallo o degradación, el backend envía alertas a través de Nodemailer.",
            "infra_deploy_title": "Infraestructura y Despliegue:",
            "infra_deploy_text": "La aplicación está contenerizada con Docker, lo que garantiza la portabilidad y la coherencia entre entornos. El despliegue se realiza en una VM en DigitalOcean, donde Nginx actúa como un proxy inverso...",
            "architecture_decisions_title": "Decisiones de Arquitectura: Nginx y Socket.IO",
            "architecture_decision_nginx": "Nginx: Fue implementado estratégicamente como proxy inverso para optimizar la entrega del frontend estático, equilibrar la carga al backend de Node.js y gestionar la terminación SSL. Su robustez y eficiencia liberaron al backend para centrarse exclusivamente en la lógica de negocio, al mismo tiempo que proporcionó una capa esencial de seguridad y rendimiento para la aplicación.",
            "architecture_decision_socketio": "Socket.IO: La elección de Socket.IO fue fundamental para la propuesta de valor del API Monitor, al habilitar la comunicación bidireccional en tiempo real. Esto permitió que el panel mostrara el estado de las APIs instantáneamente, eliminando la necesidad de sondeo y asegurando una experiencia de usuario fluida y reactiva, con menor latencia y un uso optimizado de los recursos del servidor.",
            "challenges_title": "Desafíos Técnicos y Soluciones/Aprendizajes",
            "challenges_text": "El desarrollo del API Monitor fue un viaje de aprendizaje intensivo, especialmente en la construcción de una arquitectura robusta y escalable para la monitorización.",
            "challenge_infra_devops_title": "Infraestructura y DevOps (VM, Docker, Nginx):",
            "challenge_infra_devops_text": "Uno de los mayores desafíos y aprendizajes fue la configuración completa de la infraestructura. Desde la creación y gestión de una Máquina Virtual (VM) en DigitalOcean, pasando por la contenerización de la aplicación con Docker, que garantizó un entorno aislado y consistente para todas las dependencias, hasta la configuración de Nginx como proxy inverso. Este proceso requirió una inmersión profunda en conceptos de redes, orquestación de contenedores y optimización de servidores, lo que resultó en un despliegue robusto y eficiente que no solo simplificó el proceso, sino que también elevó la robustez y la escalabilidad de la solución.",
            "challenge_realtime_comm_title": "Comunicación en Tiempo Real con Socket.IO:",
            "challenge_realtime_comm_text": "La implementación de Socket.IO para la comunicación bidireccional en tiempo real fue otro punto de gran aprendizaje. Dominar la configuración del servidor y del cliente, y asegurar que las actualizaciones de estado de las APIs se entregaran instantánea y fiablemente al panel, fue fundamental para la propuesta de valor de la aplicación.",
            "challenge_queue_mgmt_title": "Gestión de Colas con BULL y Redis:",
            "challenge_queue_mgmt_text": "Para manejar la programación asíncrona y el procesamiento de las verificaciones de API, la integración de BULL (con Redis como backend) fue crucial. Esto permitió crear un sistema de colas resiliente, capaz de procesar un gran volumen de tareas de monitorización sin bloquear el servidor principal, garantizando que las verificaciones ocurran de manera fiable y escalable.",
            "challenge_reliable_scheduling_title": "Programación Fiable y Precisión de la Monitorización:",
            "challenge_reliable_scheduling_text": "Asegurar que las verificaciones de API ocurran en intervalos exactos, incluso bajo carga, requirió una implementación cuidadosa de programadores y workers, con mecanismos de reintento y manejo de fallos. La configuración de criterios de éxito (estado HTTP, contenido de la respuesta) y la implementación de múltiples intentos antes de declarar una API 'caída' fueron cruciales para evitar alertas innecesarias y garantizar la precisión del estado reportado.",
            "challenge_historical_data_title": "Visualización de Datos Históricos:",
            "challenge_historical_data_text": "Desarrollar una forma eficiente de almacenar y consultar grandes volúmenes de datos de monitorización para generar gráficos de tendencias de rendimiento fue un aprendizaje significativo en la optimización de bases de datos y el procesamiento de datos.",
            "view_project_online": "Ver Proyecto Online",
            "repo_frontend": "Repositorio Frontend",
            "repo_backend": "Repositorio Backend"
        }
    }
}